Revit 2026 API

# SpotLightDistribution(SpotLightDistribution) Constructor

---

Creates a copy of the given spotlight distribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public SpotLightDistribution(
	SpotLightDistribution other
)
```
```vb
Public Sub New (
	other As SpotLightDistribution
)
```
```cpp
public:
SpotLightDistribution(
	SpotLightDistribution^ other
)
```
```fsharp
new :
        other : SpotLightDistribution -> SpotLightDistribution
```

#### Parameters

other SpotLightDistribution

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

SpotLightDistribution Class

SpotLightDistribution Overload

Autodesk.Revit.DB.Lighting Namespace